Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_endWatch_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_endWatch_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/endWatch"
        name                  = "endWatch"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#488a025cf0767aa9f396a3c868a60884"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_initWatch_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_initWatch_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/initWatch"
        name                  = "initWatch"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#488a025cf0767aa9f396a3c868a60884"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2callback_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2callback_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2callback"
        name                  = "oauth2callback"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#488a025cf0767aa9f396a3c868a60884"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#488a025cf0767aa9f396a3c868a60884"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_onNewMessage_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_onNewMessage_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/onNewMessage"
        name                  = "onNewMessage"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#488a025cf0767aa9f396a3c868a60884"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "oTNgaA==" -> (known after apply)
      ~ detect_md5hash   = "P6WHihiiZIclVyh6hmYXDg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "******************************************************************************" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "P6WHihiiZIclVyh6hmYXDg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%233fa5878a18a264872557287a8666170e?generation=1642775717908604&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "gmail_notifier.zip#3fa5878a18a264872557287a8666170e" -> "gmail_notifier.zip#488a025cf0767aa9f396a3c868a60884" # forces replacement
      ~ output_name      = "gmail_notifier.zip#3fa5878a18a264872557287a8666170e" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%233fa5878a18a264872557287a8666170e" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #74](https://github.com/Zenika/lilaobot/actions/runs/1729232685)